app/controllers/books_controller.rb

INSERT INTO "books" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "llll"], ["created_at", "2021-03-01 07:36:42.092457"], ["updated_at", "2021-03-01 07:36:42.092457"], ["title", "llll"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      @books = Book.all